<template>
  <div>
    <div class="news-list">
      <router-link to="/" class="back" >Назад</router-link>

      <h1 class="news">News</h1>
      <div class="news__container">
        <div class="news" @click="showModal(item)" v-for="item in this.news" :key="item.id">
        <news-item
            :data="item"
        ></news-item>
      </div>
      </div>
    </div>
    <page-news-only  v-show="isModalVisible"  :news="this.onlyNews" @close="closeModal" class="news__full"></page-news-only>
  </div>
</template>

<script>
import NewsItem from "../components/newsItem";
import PageNewsOnly from "../components/modalPage";

export default {
  components: {
    NewsItem,PageNewsOnly
  },
  data () {
    return {
      onlyNews: [],
      isModalVisible: false,
      news: [
        {
          id:1,
          newsTitle:'Морозная погода без осадков ожидает томичей во вторник',
          newsText:' Столбики термометров днем во вторник в Томске опустятся до минус 27 градусов, осадков в городе не ожидается, сообщается на сайте регионального гидрометцентра.\n' +
              '\n' +
              '"По городу Томску днем (во вторник) переменная облачность, преимущественно без осадков. Ветер северный 3-8 метров в секунду.  Температура днем – минус 25-27 градусов", – говорится в сообщении.\n' +
              '\n' +
              'По Томской области днем во вторник также переменная облачность, местами небольшой снег и изморозь. Ветер северный 3-8 метров в секунду. Температура воздуха днем – минус 23-28 градусов, местами похолодает до минус 33 градусов.\n' +
              '\n' +
              'На дорогах города и области местами гололедица.'
        },{
          id:2,
          newsTitle:'Суд продлил арест мэра Томска Кляйна на 2 месяца',
          newsText:'Кировский районный суд Томска в понедельник продлил арест временно отстраненному от должности мэру Томска Ивану Кляйну, обвиняемому в превышении должностных полномочий, до 13 марта, передает корреспондент РИА Томск из зала суда.\n' +
              '\n' +
              'Ранее сообщалось, что 13 ноября Кляйн был задержан в рамках расследования ' +
              'уголовного дела о превышении должностных полномочий. По версии следствия, ' +
              'в 2016 году мэр, действуя в интересах ОАО "Томское пиво" (Кляйну принадлежит' +
              ' 51% акций компании), препятствовал строительству микрорайона на улице Мокрушина.В свою очередь Кляйн ' +
              'сообщил суду о том, что на вторник ему назначена экспертиза в лечебном учреждении. ' +
              'Он также сообщил об ухудшении состояния своего здоровья. На заседании было предоставлено слово ' +
              'известным томичам, которые поручились за то, что Кляйн будет своевременно являться в суд. Кляйн свою ' +
              'вину не признал. Суд заключил его под стражу до 13 января. Изначально защита Кляйна просила избрать' +
              ' меру пресечения, не связанную с заключением под стражу.'
        },{
          id:3,
          newsTitle:'Долина переселенцев: готов проект нового микрорайона на востоке Томска',
          newsText:'Cпециалисты томской "Архитектурно-Конструкторской Мастерской-3" (АКМ-3) завершили проектирование нового микрорайона рядом с Зелеными ' +
              'Горками, где будет построено жилье для 8,5 тысячи переселенцев из аварийного жилья. Проект предполагает возведение десяти ' +
              'панельных 17-этажек, школы на 1100 мест и трех детских садов'
        },
        {
          id:4,
          newsTitle:'0:46  12 января 2021 г.\n' +
              'Жвачкин и Галажинский вошли в оргкомитет Года науки и технологий в РФ',
          newsText:'Власти РФ утвердили состав оргкомитета по проведению в стране Года науки и технологий; в список из более чем 70 фамилий попали ректор Томского госуниверситета Эдуард Галажинский и губернатор Томской области Сергей Жвачкин, следует из опубликованного в понедельник вечером распоряжения администрации президента РФ.\n' +
              '\n' +
              'Ранее сообщалось, что президент РФ Владимир Путин объявил 2021 год Годом науки и технологий.Как следует из опубликованного в понедельник распоряжения администрации президента, власти утвердили состав оргкомитета проведения Года науки и технологий. В него вошли члены правительства, ректоры крупнейших вузов, а также главы госкорпораций и ряда регионов – всего около 70 человек.\n' +
              'В оргкомитет вошли томичи – ректор ТГУ Галажинский и губернатор Жвачкин'
        },{
          id:5,
          newsTitle:'Томские компании выиграли все аукционы на ремонт местных дорог в 2021г',
          newsText:'"Томская строительная компания", "Строительно-ремонтная компания" и "Томскдорстрой" выиграли аукционы и ' +
              'будут в 2021 году ремонтировать городские улицы на средства нацпроекта "Безопасные и качественные ' +
              'автомобильные дороги"; всего на ремонт томских магистралей будет направлено 600 миллионов рублей, сообщает во' +
              ' вторник пресс-служба мэрии.\n' +
              '\n' +
              'Уточняется, что мэрия Томска завершила аукционы по определению подрядчиков на ремонт городских дорог в 2021 ' +
              'году в рамках нацпроекта "Безопасные и качественные автомобильные дороги". Победителями стали ООО "ТСК" ' +
              '(два аукциона), ООО "Стрек" и ООО "Томскдорстрой". Пока мэрия заключила два из четырех муниципальных контрактов. Оставшиеся заключат до февраля.'
        },
        {
          id:6,
          newsTitle:'Томские компании выиграли все аукционы на ремонт местных дорог в 2021г',
          newsText:'"Томская строительная компания", "Строительно-ремонтная компания" и "Томскдорстрой" выиграли аукционы и ' +
              'будут в 2021 году ремонтировать городские улицы на средства нацпроекта "Безопасные и качественные ' +
              'автомобильные дороги"; всего на ремонт томских магистралей будет направлено 600 миллионов рублей, сообщает во' +
              ' вторник пресс-служба мэрии.\n' +
              '\n' +
              'Уточняется, что мэрия Томска завершила аукционы по определению подрядчиков на ремонт городских дорог в 2021 ' +
              'году в рамках нацпроекта "Безопасные и качественные автомобильные дороги". Победителями стали ООО "ТСК" ' +
              '(два аукциона), ООО "Стрек" и ООО "Томскдорстрой". Пока мэрия заключила два из четырех муниципальных контрактов. Оставшиеся заключат до февраля.'
        },
        {
          id:7,
          newsTitle:'Томские компании выиграли все аукционы на ремонт местных дорог в 2021г',
          newsText:'"Томская строительная компания", "Строительно-ремонтная компания" и "Томскдорстрой" выиграли аукционы и ' +
              'будут в 2021 году ремонтировать городские улицы на средства нацпроекта "Безопасные и качественные ' +
              'автомобильные дороги"; всего на ремонт томских магистралей будет направлено 600 миллионов рублей, сообщает во' +
              ' вторник пресс-служба мэрии.\n' +
              '\n' +
              'Уточняется, что мэрия Томска завершила аукционы по определению подрядчиков на ремонт городских дорог в 2021 ' +
              'году в рамках нацпроекта "Безопасные и качественные автомобильные дороги". Победителями стали ООО "ТСК" ' +
              '(два аукциона), ООО "Стрек" и ООО "Томскдорстрой". Пока мэрия заключила два из четырех муниципальных контрактов. Оставшиеся заключат до февраля.'
        }
      ]
    }
  },
  methods:{
    showModal(data) {
      this.onlyNews = data
      console.log(this.onlyNews)
      this.isModalVisible = true;


    },
    closeModal() {
      this.isModalVisible = false;
    }

  }

}
</script>
<style lang="sass" >
.news-list
  margin-top: -10px
  margin-left: -10px
  margin-right: -10px
  background: url('../assets/news.jpg') no-repeat top center
  -webkit-background-size: 100%
  -moz-background-size: 100%
  -o-background-size: 100%
  background-size: 100%
  -webkit-background-size: cover
  -moz-background-size: cover
  -o-background-size: cover
  background-size: cover
//background: rgb(247,113,39)
  //background: linear-gradient(90deg, rgba(247,113,39,1) 0%, rgba(251,150,72,1) 11%, rgba(121,105,88,1) 99%)
.news
  width: 100%
  display: flex
  padding: 10px
  margin-bottom: 10px
  box-sizing: border-box
  opacity: 1!important
  &__title
    text-align: left
.back
  text-decoration: none
  color: black
  text-align: left
  padding-top: 20px
  padding-left: 40px
  position: relative
  cursor: pointer
  display: block
  &:before
    content: ''
    display: block
    position: absolute
    background-image: url('../assets/arrow.png')
    background-size: cover
    width: 16px
    height: 12px
    left: 10px
@media screen and (min-width: 768px)
  .news
    width: 50%
    &__container
      display: inline-flex
      flex-wrap: wrap
@media screen and (min-width: 1280px)
  .news
    width: 30%
</style>